IDS_DGNCALCBASE_TEST = "DgnCalcBase-Test(Lang:EN)"
IDS_MESHPMCV_AUTOMESH_SectionData = "Section data is not suitable for Mesh Generatio."
IDS_MESHPMCV_AUTOMESH_MakeMesh = "Failed to generate Auto-Mesh."
IDS_MESHPMCV_AUTOMESH_Property = "Failed to calculate section properties of the Auto Meshed Section."
IDS_MESHPMCV_PROPERTY_Area = "Failed to calculate section properties ( Cross section )."
IDS_MESHPMCV_PROPERTY_1stInertia = "Failed to calculate section properties ( 1st moment of inertia )."
IDS_MESHPMCV_PROPERTY_2ndInertia = "Failed to calculate section properties ( 2nd moment of inertia )."
IDS_MESHPMCV_PROPERTY_PlasticCent = "Failed to calculate section properties ( Plastic centroid )."
IDS_MESHPMCV_MAKECURV_PMCvAngle = "There is an error in the basic angle information for PM curve creation."
IDS_MESHPMCV_MAKECURV_PMCvLine = "PM Curve creation failed."
IDS_MESHPMCV_TUNECURV_LessLine = "The automatically adjusted PM Curve is less than the original PM Curve."
IDS_MESHPMCV_CALRATIO_SelectLine = "There is an error in PM curve candidates for calculation of design strength."
IDS_MESHPMCV_CALRATIO_FindStrength = "Failed to calculate design strength."
IDS_MESHPMCV_CALRATIO_MakeCurve = "Failed to calculate PM Curve for design strength."
IDS_MESHPMCV_CALRATIO_OverIncAngle = "The increment angle is too large."
IDS_MESHPMCV_CALRATIO_ForceSum = "Failed to calculate the sum of forces."
IDS_GEO_DGNCALC_PILE_FDN = "Pile foundation"
IDS_GEO_DGNCALC_FOOT_FDN = "Direct foundation"
IDS_GEO_DGNCALC_FDN_BEARING_REVIEW = "Bearing capacity check"
IDS_GEO_DGNCALC_FDN_FRICTION_RESULT = "Negative skin friction"
IDS_GEO_DGNCALC_FDN_SETTLE_RESULT = "Settlement check"
IDS_GEO_DGNCALC_FDN_DIR_RESULT = "Lateral bearing capacity"
IDS_GEO_DGNCALC_FDN_DGN_STANDARD_2009 = "Structures foundation design standard (2009.3)"
IDS_GEO_DGNCALC_FDN_RAILBRIDGE_DGN_2004 = "Railway Bridge Design Standard (2004)"
IDS_GEO_DGNCALC_FDN_BRIDGE_DGN_SPEC_2008 = "Bridge design specifications (2008)"
IDS_GEO_DGNCALC_FDN_TIP_BEARING = "End bearing capacity"
IDS_GEO_DGNCALC_FDN_FRICTION = "Skin friction"
IDS_GEO_DGNCALC_FDN_PILE_TYPE = "Driven pile"
IDS_GEO_DGNCALC_FDN_DRILLED = "Cast-in-place pile"
IDS_GEO_DGNCALC_FDN_PILE_PURCHASE = "Bored precast pile"
IDS_GEO_DGNCALC_FDN_INTERVAL_PILE = "Drilled pile"
IDS_GEO_DGNCALC_FDN_STEEL = "Steel pipe pile"
IDS_GEO_DGNCALC_FDN_STATICS_REVIEW = "Statics check"
IDS_GEO_DGNCALC_FDN_FIELD_TEST = "Field test"
IDS_GEO_DGNCALC_FDN_BEARING_ROCK_REVIEW = "Rock bearing"
IDS_GEO_DGNCALC_SAND = "Sand"
IDS_GEO_DGNCALC_CLAY = "Clay"
IDS_GEO_DGNCALC_ROCK = "Rock"
IDS_GEO_DGNCALC_FDN_SPT = "Standard Penetration Test"
IDS_GEO_DGNCALC_FDN_CPT = "Static Cone Penetration Test (CPT)"
IDS_GEO_DGNCALC_FDN_PMT = "Pressuremeter test"
IDS_GEO_DGNCALC_FDN_PBT = "Plate bearing test"
IDS_GEO_DGNCALC_FDN_VST = "Vane shear test"
IDS_GEO_DGNCALC_FDN_ROWE_ARMITAGE = "Rowe. et al"
IDS_GEO_DGNCALC_FDN_ZHANG_EINSTEIN = "Zhang. et al"
IDS_GEO_DGNCALC_FDN_CANADIAN_2006 = "Canada foundation (2006)"
IDS_GEO_DGNCALC_FDN_CANADIAN_1985 = "Canada foundation (1985)"
IDS_GEO_DGNCALC_FDN_NAVFAC_1982 = "NAVFAC(1982)"
IDS_GEO_DGNCALC_FDN_TOUMA_REESE_QUIROS = "Reese. et al"
IDS_GEO_DGNCALC_FDN_MEYERHOF_1971 = "Meyerhof"
IDS_GEO_DGNCALC_FDN_MEYERHOF = "Meyerhof"
IDS_GEO_DGNCALC_FDN_TOUMA_REESE = "Touma. et al"
IDS_GEO_DGNCALC_FDN_QUIROS_REESE = "Qurios. et al"
IDS_GEO_DGNCALC_FDN_REESE_ONEILL = "Reese. et al"
IDS_GEO_DGNCALC_FDN_BASE_STANDARD = "Structures foundation design standard"
IDS_GEO_DGNCALC_FDN_ASSHTO = "AASHTO"
IDS_GEO_DGNCALC_FDN_FHWA = "FHWA"
IDS_GEO_DGNCALC_FDN_DRAIN_CONSIDER = "considering c-Φ"
IDS_GEO_DGNCALC_FDN_ROCKSTRENTH_JOINT = "Rock strength and joint properties"
IDS_GEO_DGNCALC_FDN_LIMITE_COMPRESS = "Borehole load test"
IDS_GEO_DGNCALC_FDN_SPT_UNLIMITE = "Standard Penetration Test"
IDS_GEO_DGNCALC_FDN_CPT_UNLIMITE = "Cone penetration tes"
IDS_GEO_DGNCALC_FDN_ROCKPILE_UNLIMITE = "Piles driven into rock"
IDS_GEO_DGNCALC_FDN_SAND_SPT = "Sandy soil - SPT"
IDS_GEO_DGNCALC_FDN_UNDRAIN_CLAY = "Clay - α factor method"
IDS_GEO_DGNCALC_FDN_EFFECT_STRESS = "Clay - β factor method"
IDS_GEO_DGNCALC_FDN_CLAY_FACTOR = "Clay - λ factor method"
IDS_GEO_DGNCALC_FDN_CONSTRUCT_DISTURB_CONSIDER = "Ground disturbance"
IDS_GEO_DGNCALC_FDN_CLAY_LAYER = "Clay layer"
IDS_GEO_DGNCALC_FDN_SAND_OFFER_TABLE = "Sandy soil ground"
IDS_GEO_DGNCALC_FDN_CLAY_ALPHA = "Clay - α factor method"
IDS_GEO_DGNCALC_FDN_CLAY_SPT = "Clay - SPT"
IDS_GEO_DGNCALC_FDN_CLAY_UNDRAIN = "Clay - Undrain strength"
IDS_GEO_DGNCALC_FDN_SAND_OFFER_FRICTION_TABLE = "Sandy soil ground"
IDS_GEO_DGNCALC_FDN_USE_SPT = "Standard Penetration Test"
IDS_GEO_DGNCALC_FDN_ROCK_1988 = "Rock - Kulhawy"
IDS_GEO_DGNCALC_FDN_ROCK_1979 = "Rock - Kenney"
IDS_GEO_DGNCALC_FDN_MEYERHOF_1976 = "Bearing capacity (Meyerhof,1976) of sandy soil using the N value from SPT"
IDS_GEO_DGNCALC_FDN_INTERNAL_FINALBLOW = "Final pile driving"
IDS_GEO_DGNCALC_FDN_INTERNAL_CONCRETEMILK = "Cement milk jet mixing"
IDS_GEO_DGNCALC_FDN_INTERNAL_CONCRETEPLACING = "Concrete casting"
IDS_GEO_DGNCALC_FDN_STEELPILE_SOFTROCK = "Steel pipe pile socketing"
IDS_GEO_DGNCALC_FDN_CPT_TIP_RESISTANCE = "Cone Penetration Test"
IDS_GEO_DGNCALC_FDN_SPT_ELSE_UNLIMITE = "SPT and undrain strength"
IDS_GEO_DGNCALC_FDN_ULTIMATE_BEARING = "Ultimate bearing"
IDS_GEO_DGNCALC_FDN_CALC_HORIZFACTOR = "Horizontal modulus of elasticity"
IDS_GEO_DGNCALC_FDN_CALC_HORIZ_BEARING = "Horizontal bearing"
IDS_GEO_DGNCALC_FDN_CALC_ELASTICFACTOR = "Ground modulus of elasticity"
IDS_GEO_DGNCALC_FDN_DAVISSION_1970 = "Clay"
IDS_GEO_DGNCALC_FDN_SOIL_N = "Standard Penetration Test"
IDS_GEO_DGNCALC_FDN_PILETYPE_BEARING = "Bearing capacity calculation for driven pile"
IDS_GEO_DGNCALC_FDN_DRILLED_BEARING = "Bearing capacity calculation for Cast-in-place piles"
IDS_GEO_DGNCALC_FDN_INTERNAL_BEARING = "Bearing capacity calculation of drilled piles"
IDS_GEO_DGNCALC_FDN_JAPAN_BRIDGE = "Japanese Road Bridge Standard"
IDS_GEO_DGNCALC_FDN_INFRA_ARCHITECT_2004 = "Structures foundation design specifications (Japanese Architectural Association, 2004)"
IDS_GEO_DGNCALC_ELASTIC_DIFF = "Elastic theory"
IDS_GEO_DGNCALC_ELASTIC_DIFF1 = "Elastic theory 1"
IDS_GEO_DGNCALC_ELASTIC_DIFF2 = "Elastic theory 2"
IDS_GEO_DGNCALC_CLAY_SAT = "Saturation clay"
IDS_GEO_DGNCALC_STRAIN_EFFECT = "Strain effect"
IDS_GEO_DGNCALC_FDN_TERZAGHI_BEARING = "Terzaghi's equation"
IDS_GEO_DGNCALC_FDN_MEYERHOF_BEARING = "Meyerhof's equation"
IDS_GEO_DGNCALC_FDN_GENERAL_SHEAR_FAIL = "General shear failure"
IDS_GEO_DGNCALC_FDN_LOCAL_SHEAR_FAIL = "Local shear failure"
IDS_GEO_DGNCALC_FDN_MODIFY_TERZAGHI = "Modified Terzaghi's equation"
IDS_GEO_DGNCALC_FDN_EXPERIENCE = "Experience"
IDS_GEO_DGNCALC_FDN_COMP_STRENGTH = "Uniaxial compression strength"
IDS_GEO_DGNCALC_FDN_GOOD_ROCK = "Good Rock"
IDS_GEO_DGNCALC_FDN_ROCK_CLASSIFICATION = "Rock Classification"
IDS_GEO_DGNCALC_FDN_PBT_TERZAGHI_PECK = "Terzaghi et al."
IDS_GEO_DGNCALC_FDN_PBT_BOND = "Bond."
IDS_GEO_DGNCALC_FDN_CANNOT_CALC_BEARING = "Cannot calculate bearing capacity."
IDS_GEO_DGNCALC_FDN_ISNOT_LOAD = "No vertical load."
IDS_GEO_DGNCALC_FDN_MSG_E2B2E1L2 = "in case e2 ≥ B/2 or e1 ≥ L/2"
IDS_GEO_DGNCALC_FDN_MSG_E2B2ELL2 = "in case eB ≥ B/2 or eL ≥ L/2"
IDS_GEO_DGNCALC_FDN_MSG_ONLYAXIALFORCE = "in case there is only axial force."
IDS_GEO_DGNCALC_FDN_MSG_ED8 = "in case e ≤ D/8 (trapezoid distribution)"
IDS_GEO_DGNCALC_FDN_MSG_ED8_TRIANGLE = "in case e > D/8 (triangle distribution)"
IDS_GEO_DGNCALC_FDN_MSG_ED2 = "in case e ≥ D/2"
IDS_GEO_DGNCALC_FDN_MSG_B6 = "in case ≤ B/6 (trapezoid distribution)"
IDS_GEO_DGNCALC_FDN_MSG_EB6_TRIANGLE = "in case e > B/6 (triangle distribution)"
IDS_GEO_DGNCALC_FDN_MSG_EL6 = "in case e ≤ L/6 (trapezoid distribution)"
IDS_GEO_DGNCALC_FDN_MSG_EL6_TRIANGLE = "in case e > L/6 (triangle distribution)"
IDS_GEO_DGNCALC_FDN_MSG_6E2B6E1L = "in case 6e2/B + 6e1/L ≤ 1.0 (trapezoid distribution)"
IDS_GEO_DGNCALC_FDN_MSG_6EBB6ELL = "in case 6eB/B + 6eL/L ≤ 1.0 (trapezoid distribution)"
IDS_GEO_DGNCALC_FDN_MSG_B6E1L = "in case /B + 6e1/L > 1.0 (triangle distribution)"
IDS_GEO_DGNCALC_FDN_MSG_B6ELL = "in case /B + 6eL/L > 1.0 (triangle distribution)"
IDS_DGNCALCBASE_MESH_FAIL = "Mesh Generation Failed."
IDS_GEO_DGNCALC_FDN_TIP_BEARING_EQ = "End bearing capacity equation of steel pipe pile socked into soft rock"
IDS_GEO_DGNCALC_FDN_ROEW_1987 = "Rowe and Armitage(1987)"
IDS_GEO_DGNCALC_FDN_ZHANG_1998 = "Zhang and Einstein(1998)"
IDS_GEO_DGNCALC_FDN_CFEM_2006 = "Canadian Foundation Engineering Manual(2006)"
IDS_GEO_DGNCALC_FDN_SPT_TIP_ULT_BEARING = "Ultimate bearing capacity of SPT"
IDS_GEO_DGNCALC_FDN_CLAY_PILETYPE_TIP_BEARING = "End bearing capacity of driven pile into clay"
IDS_GEO_DGNCALC_FDN_CPT_TIP_BEARING = "Ultimate bearing capacity by CPT"
IDS_GEO_DGNCALC_FDN_DISTURB_TIP_BEARING = "End bearing capacity by ground disturbance under construction"
IDS_GEO_DGNCALC_FDN_CLAY_DRILLED_TIP_BEARING = "End bearing capacity of cast-in-place pile in clay"
IDS_GEO_DGNCALC_FDN_TOUMA_1974 = "Touma and Reese (1974), Quiros and Reese (1977)"
IDS_GEO_DGNCALC_FDN_INTERNAL_TIP_ULT_BEARING = "End bearing capacity of drilled pile(cement milk grouting)"
IDS_GEO_DGNCALC_FDN_MEYERHOF_1956 = "Meyerhof's equation (1956) "
IDS_GEO_DGNCALC_FDN_INFRA_ARCHITECT_JAPAN_2004 = "Structures foundation design specifications (Japanese Architectural Association, 2004)"
IDS_GEO_DGNCALC_FDN_BASE_STANDARD_1997 = "Structures foundation design standard (1997)"
IDS_GEO_DGNCALC_FDN_CGS_1985 = "Canadian Geotechnical Society (1985)"
IDS_DGNCALCBASE_CALC_SECT_PROP_FAIL = "Calculation of section property is failed."
IDS_DGNCALCBASE_ERROR_SECT_DATA__s = "An error occured while using section data file( %s ).\nError :"
IDS_UNIT_LENGTH_MM = "mm"
IDS_UNIT_LENGTH_CM = "cm"
IDS_UNIT_LENGTH_M = "m"
IDS_UNIT_LENGTH_IN = "in"
IDS_UNIT_LENGTH_FT = "ft"
IDS_UNIT_FORCE_KG = "kgf"
IDS_UNIT_FORCE_TON = "tonf"
IDS_UNIT_FORCE_N = "N"
IDS_UNIT_FORCE_KN = "kN"
IDS_UNIT_FORCE_LBF = "lbf"
IDS_UNIT_FORCE_KIP = "kip"
IDS_UNIT_FORCE_KIPs = "kips"
IDS_UNIT_DEGREE = "deg"
